STM8-SPL-license/discussion/Header/STM8AF_STM8S.h
  /* pointer to port F registers */
  #if defined(PORTF_BaseAddress)
    #define _GPIOF      _SFR(PORT_t,  PORTF_BaseAddress)    ///< bitfield access to port F
    #define _GPIOF_ODR  _SFR(uint8_t, PORTF_BaseAddress+0)  ///< port F output register
    #define _GPIOF_IDR  _SFR(uint8_t, PORTF_BaseAddress+1)  ///< port F input register
    #define _GPIOF_DDR  _SFR(uint8_t, PORTF_BaseAddress+2)  ///< port F direction register
    #define _GPIOF_CR1  _SFR(uint8_t, PORTF_BaseAddress+3)  ///< port F control register 1
    #define _GPIOF_CR2  _SFR(uint8_t, PORTF_BaseAddress+4)  ///< port F control register 2
  #endif

  /* pointer to port G registers */
  #if defined(PORTG_BaseAddress)
    #define _GPIOG      _SFR(PORT_t,  PORTG_BaseAddress)    ///< bitfield access to port G
    #define _GPIOG_ODR  _SFR(uint8_t, PORTG_BaseAddress+0)  ///< port G output register
    #define _GPIOG_IDR  _SFR(uint8_t, PORTG_BaseAddress+1)  ///< port G input register
    #define _GPIOG_DDR  _SFR(uint8_t, PORTG_BaseAddress+2)  ///< port G direction register
    #define _GPIOG_CR1  _SFR(uint8_t, PORTG_BaseAddress+3)  ///< port G control register 1
    #define _GPIOG_CR2  _SFR(uint8_t, PORTG_BaseAddress+4)  ///< port G control register 2
  #endif

  /* pointer to port H registers */
  #if defined(PORTH_BaseAddress)
    #define _GPIOH      _SFR(PORT_t,  PORTH_BaseAddress)    ///< bitfield access to port H
    #define _GPIOH_ODR  _SFR(uint8_t, PORTH_BaseAddress+0)  ///< port H output register
    #define _GPIOH_IDR  _SFR(uint8_t, PORTH_BaseAddress+1)  ///< port H input register
    #define _GPIOH_DDR  _SFR(uint8_t, PORTH_BaseAddress+2)  ///< port H direction register
    #define _GPIOH_CR1  _SFR(uint8_t, PORTH_BaseAddress+3)  ///< port H control register 1
    #define _GPIOH_CR2  _SFR(uint8_t, PORTH_BaseAddress+4)  ///< port H control register 2
  #endif

  /* pointer to port I registers */
  #if defined(PORTI_BaseAddress)
    #define _GPIOI      _SFR(PORT_t,  PORTI_BaseAddress)    ///< bitfield access to port I
    #define _GPIOI_ODR  _SFR(uint8_t, PORTI_BaseAddress+0)  ///< port I output register
    #define _GPIOI_IDR  _SFR(uint8_t, PORTI_BaseAddress+1)  ///< port I input register
    #define _GPIOI_DDR  _SFR(uint8_t, PORTI_BaseAddress+2)  ///< port I direction register
    #define _GPIOI_CR1  _SFR(uint8_t, PORTI_BaseAddress+3)  ///< port I control register 1
    #define _GPIOI_CR2  _SFR(uint8_t, PORTI_BaseAddress+4)  ///< port I control register 2
  #endif

  /* PORT Module Reset Values (all ports) */
  #define _GPIO_ODR_RESET_VALUE ((uint8_t)0x00)
  #define _GPIO_DDR_RESET_VALUE ((uint8_t)0x00)
  #define _GPIO_CR1_RESET_VALUE ((uint8_t)0x00)
  #define _GPIO_CR2_RESET_VALUE ((uint8_t)0x00)

  /* macro for accessing pin registers (all ports) */
  #define _GPIO_PIN0   ((uint8_t) (0x01 << 0))
  #define _GPIO_PIN1   ((uint8_t) (0x01 << 1))
  #define _GPIO_PIN2   ((uint8_t) (0x01 << 2))
  #define _GPIO_PIN3   ((uint8_t) (0x01 << 3))
  #define _GPIO_PIN4   ((uint8_t) (0x01 << 4))
  #define _GPIO_PIN5   ((uint8_t) (0x01 << 5))
  #define _GPIO_PIN6   ((uint8_t) (0x01 << 6))
  #define _GPIO_PIN7   ((uint8_t) (0x01 << 7))

#endif // PORTx_BaseAddress



//------------------------
// NVM Module FLASH (all devices, but differet sizes)
//------------------------
#if (FLASH_BaseAddress)

  /** struct containing FLASH memory registers */
  typedef struct {

    /** Flash control register 1 (FLASH_CR1) */
    struct {
      _BITS   FIX   : 1;    ///< Fixed Byte programming time
      _BITS   IE    : 1;    ///< Flash Interrupt enable
      _BITS   AHALT : 1;    ///< Power-down in Active-halt mode
      _BITS   HALT  : 1;    ///< Power-down in Halt mode
      _BITS   res   : 4;    ///< Reserved
      } reg;
    } CR1;


    /** Flash control register 2 (FLASH_CR2) */
    struct {
      _BITS   PRG   : 1;    ///< Standard block programming
      _BITS   res   : 3;    ///< Reserved
      _BITS   FPRG  : 1;    ///< Fast block programming
      _BITS   ERASE : 1;    ///< Block erasing
      _BITS   WPRG  : 1;    ///< Word programming
      _BITS   OPT   : 1;    ///< Write option bytes
    } CR2;


    /** complementary Flash control register 2 (FLASH_NCR2) */
    struct {
      _BITS PRG     : 1;    ///< Standard block programmingHAS_FLASH
      _BITS res     : 3;    ///< Reserved
      _BITS FPRG    : 1;    ///< Fast block programming
      _BITS ERASE   : 1;    ///< Block erasing
      _BITS WPRG    : 1;    ///< Word programming
      _BITS OPT     : 1;    ///< Write option bytes
    } NCR2;


    /** Flash protection register (FLASH_FPR) */
    struct {
      _BITS WPB     : 6;    ///< User boot code area protection bits
      _BITS res     : 2;    ///< Reserved
    } FPR;


    /** complementary Flash protection register (FLASH_NFPR) */
    struct {
      _BITS WPB     : 6;    ///< User boot code area protection bits
      _BITS res     : 2;    ///< Reserved
    } NFPR;


    /** Flash status register (FLASH_IAPSR) */
    struct {
      _BITS WR_PG_DIS : 1;  ///< Write attempted to protected page flag
      _BITS PUL       : 1;  ///< Flash Program memory unlocked flag
      _BITS EOP       : 1;  ///< End of programming (write or erase operation) flag
      _BITS DUL       : 1;  ///< Data EEPROM area unlocked flag
      _BITS res       : 2;  ///< Reserved, forced by hardware to 0
      _BITS HVOFF     : 1;  ///< End of high voltage flag
      _BITS res2      : 1;  ///< Reserved
    } IAPSR;


    /** Reserved registers (2B) */
    uint8_t   res[2];


    /** Flash program memory unprotecting key register (FLASH_PUKR). No bit access */
    uint8_t   PUKR;


    /** Reserved register (1B) */
    uint8_t   res2[2];


    /** Data EEPROM unprotection key register (FLASH_DUKR). No bit access */
    uint8_t   DUKR;

  } FLASH_t;

  /// pointer to all flash registers (all devices, but differet sizes)
  #define _FLASH        _SFR(FLASH_t,  FLASH_BaseAddress)     ///< bitfield access to TIM4
  #define _FLASH_CR1    _SFR(uint8_t,  FLASH_BaseAddress+0)   ///< Flash control register 1 (FLASH_CR1)
  #define _FLASH_CR2    _SFR(uint8_t,  FLASH_BaseAddress+1)   ///< Flash control register 2 (FLASH_CR2)
  #define _FLASH_NCR2   _SFR(uint8_t,  FLASH_BaseAddress+2)   ///< complementary Flash control register 2 (FLASH_NCR2)
  #define _FLASH_FPR    _SFR(uint8_t,  FLASH_BaseAddress+3)   ///< Flash protection register (FLASH_FPR)
  #define _FLASH_NFPR   _SFR(uint8_t,  FLASH_BaseAddress+4)   ///< complementary Flash protection register (FLASH_NFPR)
  #define _FLASH_IAPSR  _SFR(uint8_t,  FLASH_BaseAddress+5)   ///< Flash status register (FLASH_IAPSR)
  // reserved (2B)
  #define _FLASH_PUKR   _SFR(uint8_t,  FLASH_BaseAddress+8)   ///< Flash program memory unprotecting key register (FLASH_PUKR)
  // reserved (2B)
  #define _FLASH_DUKR   _SFR(uint8_t,  FLASH_BaseAddress+11)  ///< Data EEPROM unprotection key register (FLASH_DUKR)

  /* FLASH Module Reset Values */
  #define _FLASH_CR1_RESET_VALUE    ((uint8_t)0x00)
  #define _FLASH_CR2_RESET_VALUE    ((uint8_t)0x00)
  #define _FLASH_NCR2_RESET_VALUE   ((uint8_t)0xFF)
  #define _FLASH_IAPSR_RESET_VALUE  ((uint8_t)0x40)
  #define _FLASH_PUKR_RESET_VALUE   ((uint8_t)0x00)
  #define _FLASH_DUKR_RESET_VALUE   ((uint8_t)0x00)

  /* Flash control register 1 (FLASH_CR1) */
  #define _FLASH_FIX              ((uint8_t) (0x01 << 0))        ///< Fixed Byte programming time [0]
  #define _FLASH_IE               ((uint8_t) (0x01 << 1))        ///< Flash Interrupt enable [0]
  #define _FLASH_AHALT            ((uint8_t) (0x01 << 2))        ///< Power-down in Active-halt mode [0]
  #define _FLASH_HALT             ((uint8_t) (0x01 << 3))        ///< Power-down in Halt mode [0]
  // reserved [7:4]

  /* Flash control register 2 and complement (FLASH_CR2 and FLASH_NCR2) */
  #define _FLASH_PRG              ((uint8_t) (0x01 << 0))        ///< Standard block programming [0]
  // reserved [3:1]
  #define _FLASH_FPRG             ((uint8_t) (0x01 << 4))        ///< Fast block programming [0]
  #define _FLASH_ERASE            ((uint8_t) (0x01 << 5))        ///< Block erasing [0]
  #define _FLASH_WPRG             ((uint8_t) (0x01 << 6))        ///< Word programming [0]
  #define _FLASH_OPT              ((uint8_t) (0x01 << 7))        ///< Write option bytes [0]

  /* Flash protection register and complement (FLASH_FPR and FLASH_NFPR) */
  #define _FLASH_WPB              ((uint8_t) (0x01 << 0))        ///< User boot code area protection bits [0]
  // reserved [7:1]

  /* Flash status register (FLASH_IAPSR) */
  #define _FLASH_WR_PG_DIS        ((uint8_t) (0x01 << 0))        ///< Write attempted to protected page flag [0]
  #define _FLASH_PUL              ((uint8_t) (0x01 << 1))        ///< Flash Program memory unlocked flag [0]
  #define _FLASH_EOP              ((uint8_t) (0x01 << 2))        ///< End of programming (write or erase operation) flag [0]
  #define _FLASH_DUL              ((uint8_t) (0x01 << 3))        ///< Data EEPROM area unlocked flag [0]
  // reserved [4]
  #define _FLASH_HVOFF            ((uint8_t) (0x01 << 5))        ///< End of high voltage flag [0]
  // reserved [7:6]

#endif // FLASH_BaseAddress



//------------------------
// Clock module CLK (implemented on all devices)
//------------------------
#if defined(CLK_BaseAddress)

  /** struct containing clock module registers (CLK) */
  typedef struct {

    /** Internal clock register (CLK_ICKR) */
    struct {
      _BITS   HSIEN   : 1;    ///< High speed internal RC oscillator enable
      _BITS   HSIRDY  : 1;    ///< High speed internal oscillator ready flag
      _BITS   FHW     : 1;    ///< Fast wakeup from Halt/Active-halt modes enable
      _BITS   LSIEN   : 1;    ///< Low speed internal RC oscillator enable
      _BITS   LSIRDY  : 1;    ///< Low speed internal oscillator ready flag
      _BITS   REGAH   : 1;    ///< Regulator power off in Active-halt mode enable
      _BITS   res     : 2;    ///< Reserved, must be kept cleared
    } ICKR;


