STM8-SPL-license/discussion/Header/STM8AF_STM8S.h
    /** External clock register (CLK_ECKR) */
    struct {
      _BITS   HSEEN   : 1;    ///< High speed external crystal oscillator enable
      _BITS   HSERDY  : 1;    ///< High speed external crystal oscillator ready
      _BITS   res     : 6;    ///< Reserved, must be kept cleared
    } ECKR;


    /** Reserved register (1B) */
    uint8_t   res[1];


    /** Clock master status register (CLK_CMSR) */
    struct {
      _BITS   CKM     : 8;    ///< Clock master status bits
    } CMSR;


    /** Clock master switch register (CLK_SWR) */
    struct {
      _BITS   SWI     : 8;    ///< Clock master selection bits
    } SWR;


    /** Switch control register (CLK_SWCR) */
    struct {
      _BITS   SWBSY   : 1;    ///< Switch busy flag
      _BITS   SWEN    : 1;    ///< Switch start/stop enable
      _BITS   SWIEN   : 1;    ///< Clock switch interrupt enable
      _BITS   SWIF    : 1;    ///< Clock switch interrupt flag
      _BITS   res     : 4;    ///< Reserved
    } SWCR;


    /** Clock divider register (CLK_CKDIVR) */
    struct {
      _BITS   CPUDIV  : 3;    ///< CPU clock prescaler
      _BITS   HSIDIV  : 2;    ///< High speed internal clock prescaler
      _BITS   res     : 3;    ///< Reserved, must be kept cleared.
    } CKDIVR;


    /** Peripheral clock gating register 1 (CLK_PCKENR1) */
    struct {
      _BITS   PCKEN_I2C       : 1;    ///< clock enable I2C
      _BITS   PCKEN_SPI       : 1;    ///< clock enable SPI
      _BITS   PCKEN_UART1     : 1;    ///< clock enable UART1
      _BITS   PCKEN_UART2     : 1;    ///< clock enable UART2
      _BITS   PCKEN_TIM4_TIM6 : 1;    ///< clock enable TIM4/TIM6
      _BITS   PCKEN_TIM2_TIM5 : 1;    ///< clock enable TIM4/TIM6
      _BITS   PCKEN_TIM3      : 1;    ///< clock enable TIM3
      _BITS   PCKEN_TIM1      : 1;    ///< clock enable TIM1
    } PCKENR1;


    /** Clock security system register (CLK_CSSR) */
    struct {
      _BITS   CSSEN   : 1;    ///< Clock security system enable
      _BITS   AUX     : 1;    ///< Auxiliary oscillator connected to master clock
      _BITS   CSSDIE  : 1;    ///< Clock security system detection interrupt enable
      _BITS   CSSD    : 1;    ///< Clock security system detection
      _BITS   res     : 4;    ///< Reserved, must be kept cleared.
    } CSSR;


    /** Configurable clock output register (CLK_CCOR) */
    struct {
      _BITS   CCOEN   : 1;    ///< Configurable clock output enable
      _BITS   CCOSEL  : 4;    ///< Configurable clock output selection.
      _BITS   CCORDY  : 1;    ///< Configurable clock output ready
      _BITS   CCOBSY  : 1;    ///< Configurable clock output busy
      _BITS   res     : 1;    ///< Reserved, must be kept cleared.
    } CCOR;


    /** Peripheral clock gating register 2 (CLK_PCKENR2) */
    struct {
      _BITS   res       : 2;    ///< Reserved
      _BITS   PCKEN_AWU : 1;    ///< clock enable AWU
      _BITS   PCKEN_ADC : 1;    ///< clock enable ADC
      _BITS   res2      : 3;    ///< Reserved
      _BITS   PCKEN_CAN : 1;    ///< clock enable CAN
    } PCKENR2;


    /** Reserved register (1B). Was CAN clock control (obsolete as of STM8 UM rev 7) */
    uint8_t   res2[1];


    /** HSI clock calibration trimming register (CLK_HSITRIMR) */
    struct {
      _BITS   HSITRIM : 4;    ///< HSI trimming value (some devices only support 3 bits, see DS!)
      _BITS   res     : 4;    ///< Reserved, must be kept cleared.
    } HSITRIMR;


    /** SWIM clock control register (CLK_SWIMCCR) */
    struct {
      _BITS   SWIMCLK : 1;    ///< SWIM clock divider
      _BITS   res     : 7;    ///< Reserved.
    } SWIMCCR;

  } CLK_t;

  /// pointer to CLK registers
  #define _CLK          _SFR(CLK_t, CLK_BaseAddress)          ///< bitfield access to clock control
  #define _CLK_ICKR     _SFR(uint8_t, CLK_BaseAddress+0)      ///< Internal clock register
  #define _CLK_ECKR     _SFR(uint8_t, CLK_BaseAddress+1)      ///< External clock register
  // reserved (1B)
  #define _CLK_CMSR     _SFR(uint8_t, CLK_BaseAddress+3)      ///< Clock master status register
  #define _CLK_SWR      _SFR(uint8_t, CLK_BaseAddress+4)      ///< Clock master switch register
  #define _CLK_SWCR     _SFR(uint8_t, CLK_BaseAddress+5)      ///< Switch control register
  #define _CLK_CKDIVR   _SFR(uint8_t, CLK_BaseAddress+6)      ///< Clock divider register
  #define _CLK_PCKENR1  _SFR(uint8_t, CLK_BaseAddress+7)      ///< Peripheral clock gating register 1
  #define _CLK_CSSR     _SFR(uint8_t, CLK_BaseAddress+8)      ///< Clock security system register
  #define _CLK_CCOR     _SFR(uint8_t, CLK_BaseAddress+9)      ///< Configurable clock output register
  #define _CLK_PCKENR2  _SFR(uint8_t, CLK_BaseAddress+10)     ///< Peripheral clock gating register 2
  // reserved (1B)
  #define _CLK_HSITRIMR _SFR(uint8_t, CLK_BaseAddress+12)     ///< HSI clock calibration trimming register
  #define _CLK_SWIMCCR  _SFR(uint8_t, CLK_BaseAddress+13)     ///< SWIM clock control register

  /* CLK Module Reset Values */
  #define _CLK_ICKR_RESET_VALUE     ((uint8_t)0x01)
  #define _CLK_ECKR_RESET_VALUE     ((uint8_t)0x00)
  #define _CLK_CMSR_RESET_VALUE     ((uint8_t)0xE1)
  #define _CLK_SWR_RESET_VALUE      ((uint8_t)0xE1)
  #define _CLK_SWCR_RESET_VALUE     ((uint8_t)0x00)
  #define _CLK_CKDIVR_RESET_VALUE   ((uint8_t)0x18)
  #define _CLK_PCKENR1_RESET_VALUE  ((uint8_t)0xFF)
  #define _CLK_PCKENR2_RESET_VALUE  ((uint8_t)0xFF)
  #define _CLK_CSSR_RESET_VALUE     ((uint8_t)0x00)
  #define _CLK_CCOR_RESET_VALUE     ((uint8_t)0x00)
  #define _CLK_HSITRIMR_RESET_VALUE ((uint8_t)0x00)
  #define _CLK_SWIMCCR_RESET_VALUE  ((uint8_t)0x00)

  /* Internal clock register (CLK_ICKR) bits */
  #define _CLK_HSIEN              ((uint8_t) (0x01 << 0))        ///< High speed internal RC oscillator enable [0]
  #define _CLK_HSIRDY             ((uint8_t) (0x01 << 1))        ///< High speed internal oscillator ready [0]
  #define _CLK_FHWU               ((uint8_t) (0x01 << 2))        ///< Fast wakeup from Halt/Active-halt modes [0]
  #define _CLK_LSIEN              ((uint8_t) (0x01 << 3))        ///< Low speed internal RC oscillator enable [0]
  #define _CLK_LSIRDY             ((uint8_t) (0x01 << 4))        ///< Low speed internal oscillator ready [0]
  #define _CLK_REGAH              ((uint8_t) (0x01 << 5))        ///< Regulator power off in Active-halt mode [0]
  // reserved [7:6]

  /* External clock register (CLK_ECKR) */
  #define _CLK_HSEEN              ((uint8_t) (0x01 << 0))        ///< High speed external crystal oscillator enable [0]
  #define _CLK_ECKR_HSERDY        ((uint8_t) (0x01 << 1))        ///< High speed external crystal oscillator ready [0]
  // reserved [7:2]

