STM8-SPL-license/discussion/Header/STM8AF_STM8S.h
    /** UART2 Control register 3 (UART2_CR3) */
    struct {
      _BITS   LBCL    : 1;    ///< Last bit clock pulse
      _BITS   CPHA    : 1;    ///< Clock phase
      _BITS   CPOL    : 1;    ///< Clock polarity
      _BITS   CKEN    : 1;    ///< Clock enable
      _BITS   STOP    : 2;    ///< STOP bits
      _BITS   LINEN   : 1;    ///< LIN mode enable
      _BITS   res     : 1;    ///< Reserved, must be kept cleared
    } CR3;


    /** UART2 Control register 4 (UART2_CR4) */
    struct {
      _BITS   ADD     : 4;    ///< Address of the UART node
      _BITS   LBDF    : 1;    ///< LIN Break Detection Flag
      _BITS   LBDL    : 1;    ///< LIN Break Detection Length
      _BITS   LBDIEN  : 1;    ///< LIN Break Detection Interrupt Enable
      _BITS   res     : 1;    ///< Reserved, must be kept cleared
    } CR4;


    /** UART2 Control register 5 (UART2_CR5) */
    struct {
      _BITS   res     : 1;    ///< Reserved, must be kept cleared
      _BITS   IREN    : 1;    ///< IrDA mode Enable
      _BITS   IRLP    : 1;    ///< IrDA Low Power
      _BITS   res2    : 1;    ///< Reserved, must be kept cleared
      _BITS   NACK    : 1;    ///< Smartcard NACK enable
      _BITS   SCEN    : 1;    ///< Smartcard mode enable
      _BITS   res3    : 2;    ///< Reserved, must be kept cleared
    } CR5;


    /** UART2 Control register 6 (UART2_CR6) */
    struct {
      _BITS   LSF     : 1;    ///< LIN Sync Field
      _BITS   LHDF    : 1;    ///< LIN Header Detection Flag
      _BITS   LHDIEN  : 1;    ///< LIN Header Detection Interrupt Enable
      _BITS   res     : 1;    ///< Reserved
      _BITS   LASE    : 1;    ///< LIN automatic resynchronisation enable
      _BITS   LSLV    : 1;    ///< LIN Slave Enable
      _BITS   res2    : 1;    ///< Reserved
      _BITS   LDUM    : 1;    ///< LIN Divider Update Method
    } CR6;


    /** UART2 guard time register register (UART2_GTR). No bit access */
    uint8_t   GTR;


    /** UART2 prescaler register register register (UART2_PSCR). No bit access */
    uint8_t   PSCR;

  } UART2_t;

  /// pointer to UART2 registers
  #define _UART2      _SFR(UART2_t,  UART2_BaseAddress)       ///< bitfield access to TIM4
  #define _UART2_SR   _SFR(uint8_t,  UART2_BaseAddress+0)     ///< UART2 Status register
  #define _UART2_DR   _SFR(uint8_t,  UART2_BaseAddress+1)     ///< UART2 data register
  #define _UART2_BRR1 _SFR(uint8_t,  UART2_BaseAddress+2)     ///< UART2 Baud rate register 1
  #define _UART2_BRR2 _SFR(uint8_t,  UART2_BaseAddress+3)     ///< UART2 Baud rate register 2
  #define _UART2_CR1  _SFR(uint8_t,  UART2_BaseAddress+4)     ///< UART2 Control register 1
  #define _UART2_CR2  _SFR(uint8_t,  UART2_BaseAddress+5)     ///< UART2 Control register 2
  #define _UART2_CR3  _SFR(uint8_t,  UART2_BaseAddress+6)     ///< UART2 Control register 3
  #define _UART2_CR4  _SFR(uint8_t,  UART2_BaseAddress+7)     ///< UART2 Control register 4
  #define _UART2_CR5  _SFR(uint8_t,  UART2_BaseAddress+8)     ///< UART2 Control register 5
  #define _UART2_CR6  _SFR(uint8_t,  UART2_BaseAddress+9)     ///< UART2 Control register 6
  #define _UART2_GTR  _SFR(uint8_t,  UART2_BaseAddress+10)    ///< UART2 guard time register register
  #define _UART2_PSCR _SFR(uint8_t,  UART2_BaseAddress+11)    ///< UART2 prescaler register register register

  /* UART2 Module Reset Values */
  #define _UART2_SR_RESET_VALUE      ((uint8_t)0xC0)
  #define _UART2_BRR1_RESET_VALUE    ((uint8_t)0x00)
  #define _UART2_BRR2_RESET_VALUE    ((uint8_t)0x00)
  #define _UART2_CR1_RESET_VALUE     ((uint8_t)0x00)
  #define _UART2_CR2_RESET_VALUE     ((uint8_t)0x00)
  #define _UART2_CR3_RESET_VALUE     ((uint8_t)0x00)
  #define _UART2_CR4_RESET_VALUE     ((uint8_t)0x00)
  #define _UART2_CR5_RESET_VALUE     ((uint8_t)0x00)
  #define _UART2_CR6_RESET_VALUE     ((uint8_t)0x00)
  #define _UART2_GTR_RESET_VALUE     ((uint8_t)0x00)
  #define _UART2_PSCR_RESET_VALUE    ((uint8_t)0x00)

  /* UART2 Status register (UART2_SR) bits */
  #define _UART2_PE               ((uint8_t) (0x01 << 0))        ///< Parity error [0]
  #define _UART2_FE               ((uint8_t) (0x01 << 1))        ///< Framing error [0]
  #define _UART2_NF               ((uint8_t) (0x01 << 2))        ///< Noise flag [0]
  #define _UART2_OR_LHE           ((uint8_t) (0x01 << 3))        ///< LIN Header Error (LIN slave mode) / Overrun error [0]
  #define _UART2_IDLE             ((uint8_t) (0x01 << 4))        ///< IDLE line detected [0]
  #define _UART2_RXNE             ((uint8_t) (0x01 << 5))        ///< Read data register not empty [0]
  #define _UART2_TC               ((uint8_t) (0x01 << 6))        ///< Transmission complete [0]
  #define _UART2_TXE              ((uint8_t) (0x01 << 7))        ///< Transmit data register empty [0]

  /* UART2 Control register 1 (UART2_CR1) bits */
  #define _UART2_PIEN             ((uint8_t) (0x01 << 0))        ///< Parity interrupt enable [0]
  #define _UART2_PS               ((uint8_t) (0x01 << 1))        ///< Parity selection [0]
  #define _UART2_PCEN             ((uint8_t) (0x01 << 2))        ///< Parity control enable [0]
  #define _UART2_WAKE             ((uint8_t) (0x01 << 3))        ///< Wakeup method [0]
  #define _UART2_M                ((uint8_t) (0x01 << 4))        ///< word length [0]
  #define _UART2_UARTD            ((uint8_t) (0x01 << 5))        ///< UART Disable (for low power consumption) [0]
  #define _UART2_T8               ((uint8_t) (0x01 << 6))        ///< Transmit Data bit 8 (in 9-bit mode) [0]
  #define _UART2_R8               ((uint8_t) (0x01 << 7))        ///< Receive Data bit 8 (in 9-bit mode) [0]

  /* UART2 Control register 2 (UART2_CR2) bits */
  #define _UART2_SBK              ((uint8_t) (0x01 << 0))        ///< Send break [0]
  #define _UART2_RWU              ((uint8_t) (0x01 << 1))        ///< Receiver wakeup [0]
  #define _UART2_REN              ((uint8_t) (0x01 << 2))        ///< Receiver enable [0]
  #define _UART2_TEN              ((uint8_t) (0x01 << 3))        ///< Transmitter enable [0]
  #define _UART2_ILIEN            ((uint8_t) (0x01 << 4))        ///< IDLE Line interrupt enable [0]
  #define _UART2_RIEN             ((uint8_t) (0x01 << 5))        ///< Receiver interrupt enable [0]
  #define _UART2_TCIEN            ((uint8_t) (0x01 << 6))        ///< Transmission complete interrupt enable [0]
  #define _UART2_TIEN             ((uint8_t) (0x01 << 7))        ///< Transmitter interrupt enable [0]

  /* UART2 Control register 3 (UART2_CR3) bits */
  #define _UART2_LBCL             ((uint8_t) (0x01 << 0))        ///< Last bit clock pulse [0]
  #define _UART2_CPHA             ((uint8_t) (0x01 << 1))        ///< Clock phase [0]
  #define _UART2_CPOL             ((uint8_t) (0x01 << 2))        ///< Clock polarity [0]
  #define _UART2_CKEN             ((uint8_t) (0x01 << 3))        ///< Clock enable [0]
  #define _UART2_STOP             ((uint8_t) 0x30)               ///< STOP bits [1:0]
  #define _UART2_STOP0            ((uint8_t) (0x01 << 4))        ///< STOP bits [0]
  #define _UART2_STOP1            ((uint8_t) (0x01 << 5))        ///< STOP bits [1]
  #define _UART2_LINEN            ((uint8_t) (0x01 << 6))        ///< LIN mode enable [0]
  // reserved [7]

