STM8-SPL-license/discussion/Header/STM8AF_STM8S.h
  /* UART2 Control register 4 (UART2_CR4) bits */
  #define _UART2_ADD              ((uint8_t) 0x0F)               ///< Address of the UART node [3:0]
  #define _UART2_ADD0             ((uint8_t) (0x01 << 0))        ///< Address of the UART node [0]
  #define _UART2_ADD1             ((uint8_t) (0x01 << 1))        ///< Address of the UART node [1]
  #define _UART2_ADD2             ((uint8_t) (0x01 << 2))        ///< Address of the UART node [2]
  #define _UART2_ADD3             ((uint8_t) (0x01 << 3))        ///< Address of the UART node [3]
  #define _UART2_LBDF             ((uint8_t) (0x01 << 4))        ///< LIN Break Detection Flag [0]
  #define _UART2_LBDL             ((uint8_t) (0x01 << 5))        ///< LIN Break Detection Length [0]
  #define _UART2_LBDIEN           ((uint8_t) (0x01 << 6))        ///< LIN Break Detection Interrupt Enable [0]
  // reserved [7]

  /* UART2 Control register 5 (UART2_CR5) bits */
  // reserved [0]
  #define _UART2_IREN             ((uint8_t) (0x01 << 1))        ///< IrDA mode Enable [0]
  #define _UART2_IRLP             ((uint8_t) (0x01 << 2))        ///< IrDA Low Power [0]
  // reserved [3]
  #define _UART2_NACK             ((uint8_t) (0x01 << 4))        ///< Smartcard NACK enable [0]
  #define _UART2_SCEN             ((uint8_t) (0x01 << 5))        ///< Smartcard mode enable [0]
  // reserved [7:6]

  /* UART2 Control register 6 (UART2_CR6) bits */
  #define _UART2_LSF              ((uint8_t) (0x01 << 0))        ///< LIN Sync Field [0]
  #define _UART2_LHDF             ((uint8_t) (0x01 << 1))        ///< LIN Header Detection Flag [0]
  #define _UART2_LHDIEN           ((uint8_t) (0x01 << 2))        ///< LIN Header Detection Interrupt Enable [0]
  // reserved [3]
  #define _UART2_LASE             ((uint8_t) (0x01 << 4))        ///< LIN automatic resynchronisation enable [0]
  #define _UART2_LSLV             ((uint8_t) (0x01 << 5))        ///< LIN Slave Enable [0]
  // reserved [6]
  #define _UART2_LDUM             ((uint8_t) (0x01 << 7))        ///< LIN Divider Update Method [0]

#endif // UART2_BaseAddress



//------------------------
// 8-Bit Timer TIM4
//------------------------
#if defined(TIM4_BaseAddress)

  /** struct containing TIM4 registers (selected devices) */
  typedef struct {

    /** TIM4 Control register (TIM4_CR) */
    struct {
      _BITS   CEN     : 1;    ///< Counter enable
      _BITS   UDIS    : 1;    ///< Update disable
      _BITS   URS     : 1;    ///< Update request source
      _BITS   OPM     : 1;    ///< One-pulse mode
      _BITS   res     : 3;    ///< Reserved
      _BITS   ARPE    : 1;    ///< Auto-reload preload enable
    } CR;


    /** Reserved registers on selected devices (2B) */
    #if defined(STM8S103) || defined(STM8S003) || defined(STM8S001)
      uint8_t   res[2];
    #endif


    /** TIM4 Interrupt enable (TIM4_IER) */
    struct {
      _BITS   UIE     : 1;    ///< Update interrupt enable
      _BITS   res     : 7;    ///< Reserved
    } IER;


    /** TIM4 Status register (TIM4_SR) */
    struct {
      _BITS   UIF     : 1;    ///< Update interrupt flag
      _BITS   res     : 7;    ///< Reserved
    } SR;


    /** TIM4 Event Generation (TIM4_EGR) */
    struct {
      _BITS   UG      : 1;    ///< Update generation
      _BITS   res     : 7;    ///< Reserved
    } EGR;


    /** TIM4 8-bit counter register (TIM4_CNTR). No bit access */
    uint8_t   CNTR;


    /** TIM4 clock prescaler (TIM4_PSCR) */
    struct {
      _BITS   PSC     : 3;    ///< clock prescaler
      _BITS   res     : 5;    ///< Reserved
    } PSCR;


    /** TIM4 8-bit auto-reload register (TIM4_ARR). No bit access */
    uint8_t   ARR;

  } TIM4_t;

  /// pointer to TIM4 registers
  #define _TIM4      _SFR(TIM4_t,  TIM4_BaseAddress)         ///< bitfield access to TIM4
  #define _TIM4_CR   _SFR(uint8_t, TIM4_BaseAddress+0)       ///< TIM4 control register
  #if defined(STM8S103) || defined(STM8S003)                 // 2B offset for selected devices
    // 2B reserved
    #define _TIM4_IER   _SFR(uint8_t, TIM4_BaseAddress+3)    ///< TIM4 interrupt enable register
    #define _TIM4_SR    _SFR(uint8_t, TIM4_BaseAddress+4)    ///< TIM4 status register
    #define _TIM4_EGR   _SFR(uint8_t, TIM4_BaseAddress+5)    ///< TIM4 event generation register
    #define _TIM4_CNTR  _SFR(uint8_t, TIM4_BaseAddress+6)    ///< TIM4 counter register
    #define _TIM4_PSCR  _SFR(uint8_t, TIM4_BaseAddress+7)    ///< TIM4 clock prescaler register
    #define _TIM4_ARR   _SFR(uint8_t, TIM4_BaseAddress+8)    ///< TIM4 auto-reload register
  #else
    #define _TIM4_IER   _SFR(uint8_t, TIM4_BaseAddress+1)    ///< TIM4 interrupt enable register
    #define _TIM4_SR    _SFR(uint8_t, TIM4_BaseAddress+2)    ///< TIM4 status register
    #define _TIM4_EGR   _SFR(uint8_t, TIM4_BaseAddress+3)    ///< TIM4 event generation register
    #define _TIM4_CNTR  _SFR(uint8_t, TIM4_BaseAddress+4)    ///< TIM4 counter register
    #define _TIM4_PSCR  _SFR(uint8_t, TIM4_BaseAddress+5)    ///< TIM4 clock prescaler register
    #define _TIM4_ARR   _SFR(uint8_t, TIM4_BaseAddress+6)    ///< TIM4 auto-reload register
  #endif

  /* TIM4 Module Reset Values */
  #define _TIM4_CR_RESET_VALUE      ((uint8_t)0x00)
  #define _TIM4_IER_RESET_VALUE     ((uint8_t)0x00)
  #define _TIM4_SR_RESET_VALUE      ((uint8_t)0x00)
  #define _TIM4_EGR_RESET_VALUE     ((uint8_t)0x00)
  #define _TIM4_CNTR_RESET_VALUE    ((uint8_t)0x00)
  #define _TIM4_PSCR_RESET_VALUE    ((uint8_t)0x00)
  #define _TIM4_ARR_RESET_VALUE     ((uint8_t)0xFF)

  /* TIM4 Control register (TIM4_CR) */
  #define _TIM4_CEN               ((uint8_t) (0x01 << 0))        ///< Counter enable [0]
  #define _TIM4_UDIS              ((uint8_t) (0x01 << 1))        ///< Counter enable [0]
  #define _TIM4_URS               ((uint8_t) (0x01 << 2))        ///< Counter enable [0]
  #define _TIM4_OPM               ((uint8_t) (0x01 << 3))        ///< Counter enable [0]
  // reserved [6:4]
  #define _TIM4_ARPE              ((uint8_t) (0x01 << 7))        ///< Counter enable [0]

  /*  TIM4 Interrupt enable (TIM4_IER) */
  #define _TIM4_UIE               ((uint8_t) (0x01 << 0))        ///< Update interrupt enable [0]
  // reserved [7:1]

  /*  TIM4 Status register (TIMx_SR) */
  #define _TIM4_UIF               ((uint8_t) (0x01 << 0))        ///< Trigger interrupt flag [0]
  // reserved [7:1]

  /*  TIM4 Event generation register (TIMx_EGR) */
  #define _TIM4_UG                ((uint8_t) (0x01 << 0))        ///< Update generation [0]
  // reserved [7:1]

  /* TIM4 Prescaler register (TIM4_PSCR) */
  #define _TIM4_PSC               ((uint8_t) 0x07)               ///< Prescaler value [2:0]
  #define _TIM4_PSC0              ((uint8_t) (0x01 << 0))        ///< Prescaler value [0]
  #define _TIM4_PSC1              ((uint8_t) (0x01 << 1))        ///< Prescaler value [1]
  #define _TIM4_PSC2              ((uint8_t) (0x01 << 2))        ///< Prescaler value [2]
  // reserved [7:3]

#endif // TIM4_BaseAddress


// undefine local macros
#undef _BITS

/*-----------------------------------------------------------------------------
    END OF MODULE DEFINITION FOR MULTIPLE INLUSION
-----------------------------------------------------------------------------*/
#endif // _STM8AF_STM8S_H_
